Repository: ahmed-ibrahim/symfony
Catalog: translations/validators.*.xliff
Languages: ar

source: This value should be false
ar: وينبغي أن تكون هذه القيمة كاذبة

source: This value should be true
ar: وينبغي أن تكون هذه القيمة الحقيقية

source: This value should be of type {{ type }}
ar: وينبغي أن تكون هذه القيمة من النوع {{ type }}

source: This value should be blank
ar: وينبغي أن تكون هذه القيمة فارغة

source: The value you selected is not a valid choice
ar: القيمة التي حددتها ليست خيارا صحيحا

source: You must select at least {{ limit }} choices
ar: يجب عليك تحديد ما لا يقل عن الحد {{ limit }} الخيارات

source: You must select at most {{ limit }} choices
ar: يجب تحديد على الأكثر {{ limit }} إختيارات

source: One or more of the given values is invalid
ar: واحد أو أكثر من القيم المعطاة غير صالحة

source: The fields {{ fields }} were not expected
ar: الحقل {{ fields }} ليس من المتوقع

source: The fields {{ fields }} are missing
ar: الحقول {{ fields }} مفقودة

source: This value is not a valid date
ar: هذه القيمة ليست تاريخا صالحا

source: This value is not a valid datetime
ar: هذه القيمة ليست صالحة التاريخ والوقت

source: This value is not a valid email address
ar: هذه القيمة ليس عنوان بريد إلكتروني صالح

source: The file could not be found
ar: لا يمكن العثور على الملف

source: The file is not readable
ar: الملف غير قابل للقراءة

source: The file is too large ({{ size }}). Allowed maximum size is {{ limit }}
ar: الملف كبير جدا ({{ size }}). الحجم الأقصى هو {{ limit }}

source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}
ar: نوع MIME الملف غير صالح ({{type}}). سمح أنواع MIME أنواع هي {{types}}

source: This value should be {{ limit }} or less
ar: وينبغي أن تكون هذه القيمة {{ limit }} أو أقل

source: This value is too long. It should have {{ limit }} characters or less
ar: هذه القيمة هي فترة طويلة جدا. ينبغي أن يكون الحد {{ limit }} حرفا أو أقل

source: This value should be {{ limit }} or more
ar: وينبغي أن تكون هذه القيمة {{ limit }} أو أكثر

source: This value is too short. It should have {{ limit }} characters or more
ar: هذه القيمة هي قصيرة جدا. ينبغي أن يكون الحد {{ limit }} حرفا أو أكثر

source: This value should not be blank
ar: وينبغي أن لا تكون هذه القيمة فارغة

source: This value should not be null
ar: وينبغي أن لا تكون هذه القيمة فارغة

source: This value should be null
ar: وينبغي أن تكون هذه القيمة فارغة

source: This value is not valid
ar: هذه القيمة غير صالحة

source: This value is not a valid time
ar: هذه القيمة ليست وقتا صالح

source: This value is not a valid URL
ar: هذه القيمة ليست صالحة URL

source: This form should not contain extra fields
ar: هذا النموذج يجب أن لا تحتوي على حقول إضافية

source: The uploaded file was too large. Please try to upload a smaller file
ar: وكان الملف الذي تم تحميله كبير جدا. الرجاء محاولة إيداع ملف أصغر

source: The CSRF token is invalid. Please try to resubmit the form
ar: ومن المنطلق CSRF غير صالح. يرجى محاولة إعادة شكل

source: The two values should be equal
ar: يجب أن تكون متساوية القيمتين

source: The file is too large. Allowed maximum size is {{ limit }}
ar: الملف كبير جدا.الحجم الأقصى هو {{ limit }}

source: The file is too large
ar: الملف كبير جدا

source: The file could not be uploaded
ar: لا يمكن أن يكون الملف تم الرفع

source: This value should be a valid number
ar: وينبغي أن تكون هذه القيمة عدد صحيح

source: This file is not a valid image
ar: هذا الملف ليس صورة صالحة

source: This is not a valid IP address
ar: هذا ليس عنوان IP صالح

source: This value is not a valid language
ar: هذه القيمة ليست لغة صالحة

source: This value is not a valid locale
ar: هذه القيمة ليست لغة صالحة

source: This value is not a valid country
ar: هذه القيمة ليست بلدا صالحا

source: This value is already used
ar: وتستخدم بالفعل هذه القيمة

source: Bad code value
ar: رمز خطأ
